ItemEvents.modifyTooltips(tooltip => {
    // 线缆
    tooltip.add('drivebywire:wire', [
        "§7远程传输红石信号，简化布线工作。",
        "§7使用方式：",
        "§71.手持线缆右键红石源开始绑定",
        "§72.右键方块表面设目标，可绑定多个",
        "§73.最后右键红石源结束绑定",
        "§7补充：信号仅传绑定方块表面，不充能方块，也不会激活临近的其他方块",
    ])

    // 剪线钳
    tooltip.add('drivebywire:wire_cutter', [
        "§7[Shift+右键]清除线缆绑定",
    ])

    // 无线红石遥控信号处理器
    tooltip.add('drivebywire:controller_hub', [
        "§7将§e无线红石遥控器§7的信号转化为线缆信号",
        "§7使用方式：",
        "§71.手持无线红石遥控器右键无线红石遥控信号处理器完成绑定",
        "§72.之后改为手持线缆进行后续绑定操作",
        "§73.与常规信号源不同的是，使用线缆绑定后需要滑动§e[鼠标滚轮]§7切换信号源",
        "§74.目前仅支持W、A、S、D、shift、鼠标左键和鼠标右键",
        "§7补充：信号仅传绑定方块，不充能方块，也不会激活临近的其他方块",
        "§c警告：破坏时不会掉落物品，因为我没搞明白代码怎么写oao"
    ])
})